load-test/load-problems-page.yml
config:
  target: http://127.0.0.1
  phases:
  # For 60 seconds, 50 users per second will arrive
    - duration: 60
      arrivalRate: 50
      name: Load problems page
scenarios:
  # Each user that arrives will make 100 requests and then disappear
  - flow:
    - loop:
      - get:
          url: '/p/problem'
      count: 100